perf/exchange-load.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Load
      duration: 120
      arrivalRate: 125

scenarios:
  - name: Exchange - Load (POST /exchange)
    flow:
      - put:
          url: "/accounts/2/balance"
          json:
            balance: 100000
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: "1"
            counterAccountId: "2"
            baseAmount: 100