perf/exchange-peak.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup
      duration: 30
      arrivalRate: 10
    - name: Peak Load
      duration: 60
      arrivalRate: 100
    - name: Cooldown
      duration: 30
      arrivalRate: 100
      rampTo: 10

scenarios:
  - name: Exchange - Peak (POST /exchange)
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: "1"
            counterAccountId: "2"
            baseAmount: 100