perf/rates-load.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Load
      duration: 120
      arrivalRate: 25

scenarios:
  - name: Rates - Load
    flow:
      - get:
          url: '/rates'